Repository: Thrisha020/server_code
Catalog: server_code/locale/*/LC_MESSAGES/messages.po
Languages: de, fr

source: Test
fr: Tester

source: BMS file not found.
fr: Fichier BMS introuvable.

source: No dependencies found.
fr: Aucune dépendance trouvée.

source: Parent Name: {parent_name}
fr: Nom parent : {parent_name}

source: Name: {parent_name}
fr: Nom : {parent_name}

source: **Responsible Node: {map_name}**
de: **Verantwortlicher Knoten: {map_name}**
fr: **Nœud responsable : {map_name}**

source: 📌 Group Relation: {group_name}
de: 📌 Gruppenbeziehung: {group_name}
fr: 📌 Relation de groupe : {group_name}

source: Group Relation: {group_name}
de: Gruppenbeziehung: {group_name}
fr: Relation de groupe : {group_name}

source: - Child Name: {file_name_unique}
de: - Kindname: {file_name_unique}
fr: - Nom enfant : {file_name_unique}

source: * Child Name: {file_name_unique}
de: * Kindname: {file_name_unique}
fr: * Nom enfant : {file_name_unique}

source: Generated Graph Files:
fr: Fichiers graphiques générés :

source: No graphs were generated.
fr: Aucun graphique n'a été généré.

source: {file} → Open in browser: {file_url}
de: {file} → Im Browser öffnen: {file_url}
fr: {file} → Ouvrir dans le navigateur : {file_url}

source: No repositories contain the file you requested.
de: Keine Repositorys enthalten die angeforderte Datei.
fr: Aucun dépôt ne contient le fichier demandé.

source: The following repository(s) contain the file you requested.
de: Die folgende(n) Repository(s) enthalten die angeforderte Datei.
fr: Le(s) dépôt(s) suivant(s) contien(nent) le fichier demandé..

source: An error occurred while processing the dependency graph:{str(e)}
de: Ein Fehler ist beim Verarbeiten des Abhängigkeitsgraphen aufgetreten: {str(e)}
fr: Une erreur s'est produite lors du traitement du graphe de dépendance : {str(e)}

source: BMS file not found.
de: BMS-Datei nicht gefunden.

source: No dependencies found.
de: Keine Abhängigkeiten gefunden.

source: No graphs were generated.
de: Es wurden keine Graphen erstellt.

source: Parent Name: {parent_name}
de: Name der übergeordneten Datei: {parent_name}

source: Generated Graph Files:
de: Generierte Graph-Dateien:
